from string import whitespace, punctuation


def get_vocabluary(text):
    result = {}
    # Ниже вместо ... вставьте блок кода - релизация логики функции
    ...
    return result


if __name__ == "__maon__":
    TEXT = """Здесь определяется текст на котором будет продемонстрирована правильность работы программы.
    Текст должен быть многострочным.

    В тексте должны быть пустые строки
    и использоваться знаки из whitespace, например """ + "\t" + """табуляция"""
    vocabluary = get_vocabluary(TEXT)
    # Ниже вместо ... вставьте блок кода - релизация вывода на экран полученного словаря слов
    ...